src/ExchangePlans/_DemoExchangeWithSubsystemsLibrary.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<ExchangePlan>
		<Properties>
			<Name>_DemoExchangeWithSubsystemsLibrary</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DocumentExportStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseFilterByCompanies</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyExportMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ItemsExportMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyExportMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReferentialInformationExportMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeObjectExportModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Items</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Companies</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/ExchangePlans/_DemoExchangeWithSubsystemsLibrary/Forms/CorrespondentInfoBaseNodeSettingsForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// FORM EVENT HANDLERS

&AtClient
Procedure BeforeClose(Cancel, StandardProcessing)
	
	DataExchangeClient.SetupFormBeforeClose(Cancel, ThisForm);
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DataExchangeServer.CorrespondentInfoBaseNodeSetupFormOnCreateAtServer(ThisForm, Metadata.ExchangePlans._DemoExchangeWithSubsystemsLibrary.Name);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	SetVisibility();
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// FORM COMMAND HANDLERS

&AtClient
Procedure OKCommand(Command)
	
	DataExchangeClient.NodeSettingsFormCloseFormCommand(ThisForm);
	
EndProcedure

&AtClient
Procedure UseFilterByCompaniesOnChange(Item)
	
	SetVisibility();
	
EndProcedure

&AtClient
Procedure SetVisibility()
	
	Items.Companies.Visible = UseFilterByCompanies;
	
EndProcedure

&AtClient
Procedure CompaniesCompanyStartChoice(Item, ChoiceData, StandardProcessing)
	
	DataExchangeClient.CorrespondentInfoBaseItemChoiceHandlerStartChoice("Company", "Catalog.Companies", Items.Companies,StandardProcessing, ExternalConnectionParameters);
	
EndProcedure

&AtClient
Procedure CompaniesChoiceProcessing(Item, SelectedValue, StandardProcessing)
	
	DataExchangeClient.CorrespondentInfoBaseItemChoiceProcessingHandler(Item, SelectedValue);
	
EndProcedure
